**Step 1 Data Exploration & Leading**

In [24]:
# Walmart Data Cleaning & Safe MySQL Export 

import pandas as pd
import os
from datetime import datetime
from sqlalchemy import create_engine
from urllib.parse import quote_plus

In [25]:
BASE_DIR = r"E:\Data Analyst\Project_Walmart"

DB_USER = "root"
DB_PASSWORD = "Smriti@8803"
DB_NAME = "walmart_db"
TABLE_NAME = "walmart"

In [27]:
def find_csv_file(base_dir):
    for root, _, files in os.walk(base_dir):
        for file in files:
            if file.lower().startswith("walmart") and file.lower().endswith(".csv"):
                return os.path.join(root, file)
    raise FileNotFoundError("No Walmart CSV found in the folder.")

# Run and check
csv_path = find_csv_file(BASE_DIR)
print("CSV Found:", csv_path)

CSV Found: E:\Data Analyst\Project_Walmart\walmart_clean_20250919_181241.csv

In [28]:
df = pd.read_csv(csv_path, encoding_errors='ignore')
print("Raw Data Shape:", df.shape)
df.head()

Raw Data Shape: (9969, 12)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [29]:
def clean_data(df):
    print("🔹 Starting cleaning process...")
    print("Original shape:", df.shape)

    df = df.drop_duplicates()
    df = df.dropna(how='all')

    if 'unit_price' in df.columns:
        df['unit_price'] = pd.to_numeric(df['unit_price'].astype(str).str.replace('$', '').str.strip(), errors='coerce')
    if 'quantity' in df.columns:
        df['quantity'] = pd.to_numeric(df['quantity'], errors='coerce')

    numeric_cols = [c for c in ['unit_price', 'quantity'] if c in df.columns]
    df = df.dropna(subset=numeric_cols)

    if 'unit_price' in df.columns and 'quantity' in df.columns:
        df['total'] = df['unit_price'] * df['quantity']

    print("✅ Data cleaned! New shape:", df.shape)
    return df

# Run cleaning
df_clean = clean_data(df)
df_clean.head()

🔹 Starting cleaning process...
Original shape: (9969, 12)
✅ Data cleaned! New shape: (9969, 12)

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [30]:
def save_csv(df, base_dir):
    timestamp = datetime.now().strftime("%Y%m%d_%H%M%S")
    path = os.path.join(base_dir, f"walmart_clean_{timestamp}.csv")
    df.to_csv(path, index=False)
    print("✅ Cleaned CSV saved at:", path)
    return path

cleaned_csv_path = save_csv(df_clean, BASE_DIR)

✅ Cleaned CSV saved at: E:\Data Analyst\Project_Walmart\walmart_clean_20250919_210535.csv

In [31]:
def push_to_mysql(df, user, password, db, table):
    try:
        engine = create_engine(f"mysql+pymysql://{user}:{quote_plus(password)}@localhost:3306/{db}")
        with engine.connect() as conn:
            df.to_sql(name=table, con=conn, if_exists='replace', index=False)
            print(f"✅ {len(df)} rows inserted into MySQL table '{table}' successfully!")
    except Exception as e:
        print("❌ Failed to insert data into MySQL:", e)

push_to_mysql(df_clean, DB_USER, DB_PASSWORD, DB_NAME, TABLE_NAME)

✅ 9969 rows inserted into MySQL table 'walmart' successfully!

In [32]:
from sqlalchemy import create_engine

# Create MySQL connection
engine = create_engine(f"mysql+pymysql://{DB_USER}:{quote_plus(DB_PASSWORD)}@localhost:3306/{DB_NAME}")

# Read first 5 rows from the table
df_sql = pd.read_sql(f"SELECT * FROM {TABLE_NAME} LIMIT 5;", con=engine)
print("✅ Data fetched from MySQL")
df_sql

✅ Data fetched from MySQL

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [33]:
row_count = pd.read_sql(f"SELECT COUNT(*) as total_rows FROM {TABLE_NAME};", con=engine)
print("✅ Total rows in table:", row_count['total_rows'][0])

✅ Total rows in table: 9969

In [34]:
# Check duplicates by all columns
duplicate_count = pd.read_sql(f"""
    SELECT COUNT(*) as duplicate_count 
    FROM (
        SELECT *, COUNT(*) 
        FROM {TABLE_NAME} 
        GROUP BY {', '.join(df_clean.columns)} 
        HAVING COUNT(*) > 1
    ) t;
""", con=engine)

print("✅ Duplicate rows in SQL table:", duplicate_count['duplicate_count'][0])

✅ Duplicate rows in SQL table: 0

In [35]:
null_check = pd.read_sql(f"""
    SELECT 
        {', '.join([f"SUM(CASE WHEN {col} IS NULL THEN 1 ELSE 0 END) AS {col}_nulls" for col in df_clean.columns])}
    FROM {TABLE_NAME};
""", con=engine)

print("✅ Null value count per column:")
null_check.T

✅ Null value count per column:

                        0
invoice_id_nulls      0.0
Branch_nulls          0.0
City_nulls            0.0
category_nulls        0.0
unit_price_nulls      0.0
quantity_nulls        0.0
date_nulls            0.0
time_nulls            0.0
payment_method_nulls  0.0
rating_nulls          0.0
profit_margin_nulls   0.0
total_nulls           0.0